balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64MC202.PIC
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR14" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR14" edc:nzwidth="16" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="QEA1R" edc:desc="" edc:mask="0x1f" edc:name="QEA1R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB1R" edc:desc="" edc:mask="0x1f" edc:name="QEB1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="QEA1R0" edc:desc="" edc:mask="0x1" edc:name="QEA1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R1" edc:desc="" edc:mask="0x1" edc:name="QEA1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R2" edc:desc="" edc:mask="0x1" edc:name="QEA1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R3" edc:desc="" edc:mask="0x1" edc:name="QEA1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R4" edc:desc="" edc:mask="0x1" edc:name="QEA1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB1R0" edc:desc="" edc:mask="0x1" edc:name="QEB1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R1" edc:desc="" edc:mask="0x1" edc:name="QEB1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R2" edc:desc="" edc:mask="0x1" edc:name="QEB1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R3" edc:desc="" edc:mask="0x1" edc:name="QEB1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R4" edc:desc="" edc:mask="0x1" edc:name="QEB1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR15" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR15" edc:nzwidth="16" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDX1R" edc:desc="" edc:mask="0x1f" edc:name="INDX1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INDX1R0" edc:desc="" edc:mask="0x1" edc:name="INDX1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R1" edc:desc="" edc:mask="0x1" edc:name="INDX1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R2" edc:desc="" edc:mask="0x1" edc:name="INDX1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R3" edc:desc="" edc:mask="0x1" edc:name="INDX1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R4" edc:desc="" edc:mask="0x1" edc:name="INDX1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR16" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR16" edc:nzwidth="16" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="QEA2R" edc:desc="" edc:mask="0x1f" edc:name="QEA2R" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB2R" edc:desc="" edc:mask="0x1f" edc:name="QEB2R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="QEA2R0" edc:desc="" edc:mask="0x1" edc:name="QEA2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA2R1" edc:desc="" edc:mask="0x1" edc:name="QEA2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA2R2" edc:desc="" edc:mask="0x1" edc:name="QEA2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA2R3" edc:desc="" edc:mask="0x1" edc:name="QEA2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA2R4" edc:desc="" edc:mask="0x1" edc:name="QEA2R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB2R0" edc:desc="" edc:mask="0x1" edc:name="QEB2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB2R1" edc:desc="" edc:mask="0x1" edc:name="QEB2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB2R2" edc:desc="" edc:mask="0x1" edc:name="QEB2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB2R3" edc:desc="" edc:mask="0x1" edc:name="QEB2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB2R4" edc:desc="" edc:mask="0x1" edc:name="QEB2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR17" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR17" edc:nzwidth="16" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDX2R" edc:desc="" edc:mask="0x1f" edc:name="INDX2R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INDX2R0" edc:desc="" edc:mask="0x1" edc:name="INDX2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX2R1" edc:desc="" edc:mask="0x1" edc:name="INDX2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX2R2" edc:desc="" edc:mask="0x1" edc:name="INDX2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX2R3" edc:desc="" edc:mask="0x1" edc:name="INDX2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX2R4" edc:desc="" edc:mask="0x1" edc:name="INDX2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR18" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR18" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0x1f" edc:name="U1RXR" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0x1f" edc:name="U1CTSR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXR0" edc:desc="" edc:mask="0x1" edc:name="U1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR1" edc:desc="" edc:mask="0x1" edc:name="U1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR2" edc:desc="" edc:mask="0x1" edc:name="U1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR3" edc:desc="" edc:mask="0x1" edc:name="U1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR4" edc:desc="" edc:mask="0x1" edc:name="U1RXR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR0" edc:desc="" edc:mask="0x1" edc:name="U1CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR1" edc:desc="" edc:mask="0x1" edc:name="U1CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR2" edc:desc="" edc:mask="0x1" edc:name="U1CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR3" edc:desc="" edc:mask="0x1" edc:name="U1CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR4" edc:desc="" edc:mask="0x1" edc:name="U1CTSR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
